## -------------------------------------------------------------
## 사용자가 정의한 모델 클래스 및 데이터셋 클래스들
## -------------------------------------------------------------

## -------------------------------------------------------------
## 모듈 로딩
## -------------------------------------------------------------
import torch
import torch.nn as nn

## -------------------------------------------------------------
## 커스텀 클래스 모델 정의 : 피쳐 784개, 타겟 10가지 0 ~ 9
##              입력    출력    활성함수
## 입력층        794    255     ReLU
## 은닉층        255    100     ReLU
## 출력층        50     10      Softmax => 손실함수에 따라 정함
## -------------------------------------------------------------   
class MnistClassifier(nn.Module):
    def __init__(self):
        super().__init__()
        self.net = nn.Sequential(
            nn.Linear(784, 255),
            nn.ReLU(),
            nn.Linear(255, 100),
            nn.ReLU(),
            nn.Linear(100, 50),
            nn.ReLU(),
            nn.Linear(50, 10)
        )

    def forward(self, x):
        return self.net(x)